{
  "feeling_of_worthlessness": [
    "My inherent worth is not defined by my thoughts, feelings, or achievements.",
    "This is just a feeling; it is not the truth of who I am.",
    "I will treat myself with the same kindness I would offer a friend feeling this way.",
    "My value as a person exists independent of my current emotional state.",
    "These difficult feelings are temporary visitors, not permanent residents."
  ],
  "anxiety_about_the_future": [
    "I cannot control the future, but I can influence how I respond to uncertainty.",
    "My anxiety shows that I care about outcomes, which reflects my values.",
    "I will focus on what I can control in this present moment.",
    "Uncertainty is uncomfortable, but it also holds space for positive possibilities.",
    "I have navigated uncertainty before and found my way through."
  ],
  "lack_of_motivation": [
    "Motivation often follows action, not the other way around.",
    "It's okay to start small; even tiny steps count as progress.",
    "My lack of motivation might be my mind's way of asking for rest or a different approach.",
    "I can be gentle with myself while still taking one small step forward.",
    "Sometimes the most courageous thing is to begin again, however slowly."
  ],
  "conflict_between_desire_and_action": [
    "It's okay that my actions and desires aren't perfectly aligned right now. I can hold both feelings at once.",
    "My awareness of this conflict is a powerful first step toward change.",
    "I will focus on compassion for myself, not judgment for my lack of action.",
    "Small steps toward alignment are still meaningful progress.",
    "This internal tension shows I care deeply about growth and authenticity."
  ],
  "self_criticism": [
    "I can acknowledge my mistakes without attacking my character.",
    "The voice of self-criticism is not the voice of truth or wisdom.",
    "I will speak to myself as I would to someone I care about.",
    "My inner critic thinks it's protecting me, but I can choose a kinder approach.",
    "Self-compassion is not self-indulgence; it's the foundation for genuine growth."
  ],
  "fear_of_failure": [
    "Failure is information, not a verdict on my worth.",
    "Every person who has achieved something meaningful has also experienced failure.",
    "I can learn to see setbacks as stepping stones rather than roadblocks.",
    "My fear of failure shows that I care about doing well, which is a strength.",
    "I am more resilient than I realize, and I can handle whatever comes."
  ],
  "financial_scarcity_mindset": [
    "My relationship with money reflects learned patterns that I can gradually shift.",
    "Scarcity thinking served a purpose once, but I can choose abundance thinking now.",
    "I have managed resources effectively in the past and can do so again.",
    "My worth is not determined by my financial situation.",
    "I can take one small step today toward financial wellness and security."
  ],
  "loneliness_in_relationships": [
    "Feeling lonely doesn't mean I am fundamentally unlovable or destined to be alone.",
    "Connection starts with the relationship I have with myself.",
    "I can reach out to others while also cultivating my own company.",
    "Loneliness is a signal that I value connection, which is beautifully human.",
    "Even small moments of genuine connection can nourish my need for belonging."
  ],
  "imposter_syndrome": [
    "My achievements are real, even when my confidence wavers.",
    "Feeling like an imposter often means I'm growing and challenging myself.",
    "I belong in spaces where I've earned my place through effort and skill.",
    "Everyone feels uncertain sometimes; it doesn't invalidate my competence.",
    "I can acknowledge my accomplishments while still having room to grow."
  ],
  "procrastination_due_to_feeling_overwhelmed": [
    "Overwhelm is often a sign that I need to break things down into smaller pieces.",
    "I don't have to do everything at once; I just need to do the next right thing.",
    "Procrastination might be my mind's way of asking for clarity or rest.",
    "I can start with the smallest possible step and build momentum from there.",
    "It's okay to ask for help when tasks feel too big to handle alone."
  ],
  "perfectionism_paralysis": [
    "Done is better than perfect, and progress is better than paralysis.",
    "My perfectionism comes from caring deeply, but I can channel that care more gently.",
    "I can aim for excellence while accepting that mistakes are part of learning.",
    "The fear of imperfection is often more painful than imperfection itself.",
    "I give myself permission to be human, which includes being imperfect."
  ],
  "social_comparison_anxiety": [
    "Other people's highlight reels are not the full story of their lives.",
    "My journey is unique, and comparing it to others' robs me of my own progress.",
    "I can appreciate others' success without diminishing my own worth.",
    "What I see in others that I admire might be qualities I can develop in myself.",
    "I am enough, exactly as I am, while also growing into who I want to become."
  ],
  "rejection_sensitivity": [
    "Rejection says more about fit and timing than about my fundamental worth.",
    "I can feel the pain of rejection without letting it define my self-concept.",
    "Not everyone will appreciate what I offer, and that's okay.",
    "Rejection often redirects me toward better opportunities and connections.",
    "I am learning to value my own approval as much as others'."
  ],
  "abandonment_fears": [
    "My fear of abandonment shows how much I value connection and love.",
    "I can work on feeling secure within myself while also nurturing relationships.",
    "People leave for many reasons, most of which have nothing to do with my worth.",
    "I have survived loss before and discovered my own resilience.",
    "I can love deeply while also trusting in my ability to be okay on my own."
  ],
  "career_dissatisfaction": [
    "Career dissatisfaction can be a compass pointing toward what I truly value.",
    "It's never too late to make changes that align with my authentic self.",
    "I can take small steps toward career fulfillment while managing practical needs.",
    "My work doesn't have to define my entire identity or worth.",
    "I can find meaning and purpose in many different ways, including outside of work."
  ],
  "body_image_concerns": [
    "My body is more than how it looks; it's the vessel that carries me through life.",
    "I can practice gratitude for what my body does rather than focusing only on appearance.",
    "The standards I hold myself to may not be realistic or kind.",
    "I deserve to treat my body with respect and care, regardless of its shape or size.",
    "My worth as a person is not determined by my physical appearance."
  ],
  "relationship_conflict_avoidance": [
    "Avoiding conflict might feel safer, but it often prevents deeper connection.",
    "I can learn to express my needs and boundaries with kindness and clarity.",
    "Healthy conflict can actually strengthen relationships when handled with care.",
    "My desire to avoid conflict shows I value harmony, which I can pursue in healthier ways.",
    "I can practice speaking up for myself in small ways to build confidence."
  ],
  "decision_making_paralysis": [
    "Most decisions are not permanent, and I can adjust course as I learn more.",
    "Perfect information is rarely available; I can make good decisions with what I have.",
    "The fear of making the wrong choice often causes more suffering than the choice itself.",
    "I can trust my judgment while also being open to new information.",
    "Taking action, even imperfect action, often provides clarity that thinking alone cannot."
  ],
  "chronic_self_doubt": [
    "Self-doubt is not the same as accurate self-assessment.",
    "I can acknowledge uncertainty without letting it paralyze me.",
    "My past successes are evidence of my capability, even when doubt creeps in.",
    "I can move forward with doubt as a passenger, not as the driver.",
    "Confidence often comes from taking action despite doubt, not from the absence of doubt."
  ],
  "emotional_numbness": [
    "Numbness might be my mind's way of protecting me from overwhelming feelings.",
    "It's okay to feel disconnected sometimes; this too is a temporary state.",
    "I can gently invite feeling back into my life without forcing it.",
    "Small moments of connection—with nature, art, or others—can help me reconnect with feeling.",
    "Numbness doesn't mean I'm broken; it means I'm human and adapting to life's challenges."
  ],
  "generic_fallback": [
    "It's okay if my thoughts feel tangled right now.",
    "I don't need to have it all figured out.",
    "My feelings are valid, even if they're hard to put into words.",
    "This moment of difficulty is temporary and will pass.",
    "I am worthy of compassion, especially from myself.",
    "Taking time to reflect on my thoughts shows strength and self-awareness.",
    "I can be gentle with myself as I navigate whatever I'm experiencing.",
    "It's human to struggle sometimes, and I'm not alone in this experience."
  ]
}